See also:

- https://towardsdatascience.com/10-python-pandas-tricks-that-make-your-work-more-efficient-2e8e483808ba

In [14]:
import pandas as pd
import numpy as np
from IPython.display import display as d

## Series and DataFrame creation

In [15]:
print('Series with axis labels:')
d(pd.Series(np.arange(5, dtype=np.int)))

print('Series from dictionary:')
future_series = {0: 'A', 1: 'B', 2: 'C'}
d(pd.Series(future_series))

print('Basic dataframe with indexes and column names:')
dates = pd.date_range("20180101", periods=6)
data = np.random.random((6,3))
column_names = ['Column1', 'Column2', 'Column3']
main_df = pd.DataFrame(data, index=dates, columns=column_names)
d(main_df)

print('DataFrame from dictionary:')
basic_dict = {'Normal': ['A', 'B', 'C'], 'Reverse': ['Z', 'Y', 'X']}
d(pd.DataFrame(basic_dict))

print('DataFrame from list of dictionary:')
basic_dict = [
    {'Normal': 'A', 'Reverse': 'Z'},
    {'Normal': 'B', 'Reverse': 'Y'},
    {'Normal': 'C', 'Reverse': 'X'},
]
d(pd.DataFrame(basic_dict))

Series with axis labels:

0    0
1    1
2    2
3    3
4    4
dtype: int64

Series from dictionary:

0    A
1    B
2    C
dtype: object

Basic dataframe with indexes and column names:

             Column1   Column2   Column3
2018-01-01  0.327352  0.347133  0.729066
2018-01-02  0.245136  0.645032  0.067911
2018-01-03  0.254010  0.756985  0.496432
2018-01-04  0.867280  0.502990  0.925608
2018-01-05  0.166709  0.168735  0.838825
2018-01-06  0.952092  0.890517  0.156634

DataFrame from dictionary:

  Normal Reverse
0      A       Z
1      B       Y
2      C       X

DataFrame from list of dictionary:

  Normal Reverse
0      A       Z
1      B       Y
2      C       X

## Indexing

In [16]:
print('Index first column:')
d(main_df['Column1'])

print('Index the first two rows:')
d(main_df[0:2])

print('Index the rows by name:')
d(main_df['20180101':'20180104'])

print('Index rows and columns by names:')
main_df.loc['20180101':'20180103',['Column1','Column3']]

print('Index rows and columns by numbers:')
d(main_df.iloc[3:5, 0:2])

print('View first two rows:')
d(main_df.head(2))

print('View last two rows:')
d(main_df.tail(2))

Index first column:

2018-01-01    0.327352
2018-01-02    0.245136
2018-01-03    0.254010
2018-01-04    0.867280
2018-01-05    0.166709
2018-01-06    0.952092
Freq: D, Name: Column1, dtype: float64

Index the first two rows:

             Column1   Column2   Column3
2018-01-01  0.327352  0.347133  0.729066
2018-01-02  0.245136  0.645032  0.067911

Index the rows by name:

             Column1   Column2   Column3
2018-01-01  0.327352  0.347133  0.729066
2018-01-02  0.245136  0.645032  0.067911
2018-01-03  0.254010  0.756985  0.496432
2018-01-04  0.867280  0.502990  0.925608

Index rows and columns by names:
Index rows and columns by numbers:

             Column1   Column2
2018-01-04  0.867280  0.502990
2018-01-05  0.166709  0.168735

View first two rows:

             Column1   Column2   Column3
2018-01-01  0.327352  0.347133  0.729066
2018-01-02  0.245136  0.645032  0.067911

View last two rows:

             Column1   Column2   Column3
2018-01-05  0.166709  0.168735  0.838825
2018-01-06  0.952092  0.890517  0.156634

## Add new Series to existing DataFrame

In [17]:
print('Add a new column')
main_df['Result'] = pd.Series([True, False, False, True, False, False], index=dates)
d(main_df)

Add a new column

             Column1   Column2   Column3  Result
2018-01-01  0.327352  0.347133  0.729066    True
2018-01-02  0.245136  0.645032  0.067911   False
2018-01-03  0.254010  0.756985  0.496432   False
2018-01-04  0.867280  0.502990  0.925608    True
2018-01-05  0.166709  0.168735  0.838825   False
2018-01-06  0.952092  0.890517  0.156634   False

## Statistics

In [18]:
main_df.describe()

        Column1   Column2   Column3
count  6.000000  6.000000  6.000000
mean   0.468763  0.551899  0.535746
std    0.346348  0.267033  0.359267
min    0.166709  0.168735  0.067911
25%    0.247354  0.386097  0.241583
50%    0.290681  0.574011  0.612749
75%    0.732298  0.728997  0.811385
max    0.952092  0.890517  0.925608

## Sorting

In [19]:
print('Sort using the index:')
d(main_df.sort_index(axis=0, ascending=False))

print('Sort on a column:')
d(main_df.sort_values(by='Column2'))

Sort using the index:

             Column1   Column2   Column3  Result
2018-01-06  0.952092  0.890517  0.156634   False
2018-01-05  0.166709  0.168735  0.838825   False
2018-01-04  0.867280  0.502990  0.925608    True
2018-01-03  0.254010  0.756985  0.496432   False
2018-01-02  0.245136  0.645032  0.067911   False
2018-01-01  0.327352  0.347133  0.729066    True

Sort on a column:

             Column1   Column2   Column3  Result
2018-01-05  0.166709  0.168735  0.838825   False
2018-01-01  0.327352  0.347133  0.729066    True
2018-01-04  0.867280  0.502990  0.925608    True
2018-01-02  0.245136  0.645032  0.067911   False
2018-01-03  0.254010  0.756985  0.496432   False
2018-01-06  0.952092  0.890517  0.156634   False

## Join

If you want to join on a column other than the index, check out the `merge` method.

In [20]:
dates2 = pd.date_range("20180101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['Column4', 'Column5']

main_df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

print('Join two DataFrames:')
d(main_df.join(main_df2))

Join two DataFrames:

             Column1   Column2   Column3  Result   Column4   Column5
2018-01-01  0.327352  0.347133  0.729066    True  0.491572  0.724694
2018-01-02  0.245136  0.645032  0.067911   False  0.911418  0.303066
2018-01-03  0.254010  0.756985  0.496432   False  0.114248  0.496321
2018-01-04  0.867280  0.502990  0.925608    True  0.677095  0.071301
2018-01-05  0.166709  0.168735  0.838825   False  0.484434  0.618090
2018-01-06  0.952092  0.890517  0.156634   False  0.117891  0.774633

## Groupby

In [21]:
main_df.groupby('Result').mean()

         Column1   Column2   Column3
Result
False   0.404487  0.615317  0.389950
True    0.597316  0.425061  0.827337

Use `agg` function

In [22]:
main_df.groupby('Result').agg({'Column1': 'mean', 'Column2': 'max', 'Column3': ['max','min']})

         Column1   Column2   Column3
            mean       max       max       min
Result
False   0.404487  0.890517  0.838825  0.067911
True    0.597316  0.502990  0.925608  0.729066

## Pivot Table

In [23]:
main_df.pivot_table(index='Column1', columns='Result', 
                   values='Column2', aggfunc='max')

Result       False     True
Column1
0.166709  0.168735       NaN
0.245136  0.645032       NaN
0.254010  0.756985       NaN
0.327352       NaN  0.347133
0.867280       NaN  0.502990
0.952092  0.890517       NaN

## Accessing to DataFrame attributes

In [24]:
print('Index:')
d(main_df.index)
print('Values:')
d(main_df.values)
print('Columns:')
d(main_df.columns)

Index:

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

Values:

array([[0.3273519083225239, 0.34713269587895046, 0.7290655164084981,
        True],
       [0.24513593801619726, 0.6450320486644376, 0.06791074436721944,
        False],
       [0.2540101248768759, 0.756985026892896, 0.4964323513476572, False],
       [0.8672801268203867, 0.5029896250389285, 0.9256075833258247, True],
       [0.1667085207108212, 0.16873503149339908, 0.8388248276123459,
        False],
       [0.9520915700759593, 0.8905168283111443, 0.15663379696995017,
        False]], dtype=object)

Columns:

Index(['Column1', 'Column2', 'Column3', 'Result'], dtype='object')

## Transformation

In [25]:
main_df

             Column1   Column2   Column3  Result
2018-01-01  0.327352  0.347133  0.729066    True
2018-01-02  0.245136  0.645032  0.067911   False
2018-01-03  0.254010  0.756985  0.496432   False
2018-01-04  0.867280  0.502990  0.925608    True
2018-01-05  0.166709  0.168735  0.838825   False
2018-01-06  0.952092  0.890517  0.156634   False

In [26]:
# Increment Column1 by one
main_df['Column1'] = main_df['Column1'].apply(lambda x: x + 1)
main_df

             Column1   Column2   Column3  Result
2018-01-01  1.327352  0.347133  0.729066    True
2018-01-02  1.245136  0.645032  0.067911   False
2018-01-03  1.254010  0.756985  0.496432   False
2018-01-04  1.867280  0.502990  0.925608    True
2018-01-05  1.166709  0.168735  0.838825   False
2018-01-06  1.952092  0.890517  0.156634   False

In [27]:
# Examples of date transformations:
# df[‘MonthYear’] = pd.to_datetime(df[‘MonthYear’])
# df[‘MonthYear’] = df[‘MonthYear’].apply(lambda x: x.date())